"Leave Application?" = "Leave Application?";

"Do you want to leave this application to open the advertisement?" = "Do you want to leave this application to open the advertisement?";

"Open Maps?" = "Open Maps?";

"Do you want to leave this application to open this advertisements with Maps?" = "Do you want to leave this application to open this advertisements with Maps?";

"Send Text Message?" = "Send Text Message?";

"Do you want to leave this application to send a text message to the number of this advertisements?" = "Do you want to leave this application to send a text message to the number of this advertisements?";

"Call Phone Number?" = "Call Phone Number?";

"Do you want to leave this application to call the number of this advertisements?" = "Do you want to leave this application to call the number of this advertisements?";

"Open YouTube?" = "Open YouTube?";

"Do you want to leave this application to open this advertisements with YouTube?" = "Do you want to leave this application to open this advertisements with YouTube?";

"Open iTunes?" = "Open iTunes?";

"Do you want to leave this application to open this advertisements with iTunes?" = "Do you want to leave this application to open this advertisements with iTunes?";

"Open Mail?" = "Open Mail?";

"Do you want to leave this application to send an e-mail to the address of this advertisement?" = "VoulezDo you want to leave this application to send an e-mail to the address of this advertisement?";

"Open Safari?"= "Open Safari?";

"Do you want to leave the application to view this page in Safari?" = "Do you want to leave the application to view this page in Safari?";

"Leave Application?" = "Leave Application?";

"Do you want to leave this application to open the advertisement?" = "Do you want to leave this application to open the advertisement?";

"Could Not Open the URL" = "Could Not Open the URL";

"Your device could not open the URL requested by advertisement" = "Your device could not open the URL requested by advertisement";

"No" = "No";

"Yes" = "Yes";

"Ok" = "Ok";